Repository: sypianski/diktilo
Catalog: VoiceInk/Localizable.xcstrings
Source language: en
Languages: ca, de, eo, pl, zh_hans

source: Your language change will take full effect after you quit and reopen Diktilo.
ca: El canvi d'idioma s'aplicarà del tot quan surtis de Diktilo i el tornis a obrir.
de: Die Sprachänderung wird vollständig wirksam, nachdem du Diktilo beendet und erneut geöffnet hast.
eo: La lingvoŝanĝo plene efikos post kiam vi ĉesigos kaj remalfermos Diktilon.
pl: Zmiana języka zacznie w pełni obowiązywać po ponownym uruchomieniu Diktilo.
zh_hans: 退出并重新打开 Diktilo 后，语言更改才会完全生效。

source: Your Diktilo journey starts with your first recording.
ca: La teva aventura amb Diktilo comença amb el primer enregistrament.
de: Deine Diktilo-Reise beginnt mit der ersten Aufnahme.
eo: Via vojaĝo kun Diktilo komenciĝas per via unua registrado.
pl: Twoja przygoda z Diktilo zaczyna się od pierwszego nagrania.
zh_hans: 你的 Diktilo 之旅从第一次录音开始。

source: Getting started
ca: Primers passos
eo: Unuaj paŝoj
pl: Pierwsze kroki

source: Set a recording shortcut
ca: Defineix una drecera d'enregistrament
eo: Agordi registran klavkombinon
pl: Ustaw skrót nagrywania

source: Open Modes to choose the shortcut that starts and stops dictation.
ca: Obre Modes per triar la drecera que inicia i atura el dictat.
eo: Malfermu Reĝimojn por elekti la klavkombinon, kiu komencas kaj ĉesigas la diktadon.
pl: Otwórz Tryby, aby wybrać skrót rozpoczynający i kończący dyktowanie.

source: Speak, then finish
ca: Parla i després acaba
eo: Parolu, poste finu
pl: Mów, a potem zakończ

source: Press the shortcut, dictate, and press it again. Diktilo transcribes in the background.
ca: Prem la drecera, dicta i torna-la a prémer. Diktilo transcriu en segon pla.
eo: Premu la klavkombinon, diktu kaj premu ĝin denove. Diktilo transskribas fone.
pl: Naciśnij skrót, dyktuj i naciśnij go ponownie. Diktilo transkrybuje w tle.

source: Pasted and copied
ca: Enganxat i copiat
eo: Algluita kaj kopiita
pl: Wklejone i skopiowane

source: Your text is inserted at the cursor and kept on the clipboard for your clipboard history.
ca: El text s'insereix a la posició del cursor i es manté al porta-retalls per a l'historial del porta-retalls.
eo: Via teksto estas enmetita ĉe la kursoro kaj konservita en la tondujo, por via tondujhistorio.
pl: Tekst zostaje wstawiony w miejscu kursora i zachowany w schowku, w historii schowka.

source: Open Modes
ca: Obrir Modes
eo: Malfermi Reĝimojn
pl: Otwórz Tryby

source: View All
ca: Veure-ho tot
eo: Vidi ĉiujn
pl: Zobacz wszystkie

source: Open the full transcription history
ca: Obrir l'historial complet de transcripcions
eo: Malfermi la tutan transskriban historion
pl: Otwórz pełną historię transkrypcji

source: Grammatical gender
ca: Gènere gramatical
de: Grammatisches Geschlecht
eo: Gramatika genro
pl: Forma gramatyczna
zh_hans: 语法性别

source: Masculine
ca: Masculí
de: Maskulin
eo: Vira
pl: Męska (zrobiłeś)
zh_hans: 阳性

source: Feminine
ca: Femení
de: Feminin
eo: Ina
pl: Żeńska (zrobiłaś)
zh_hans: 阴性

source: Neuter
ca: Neutre
de: Neutrum
eo: Neŭtra
pl: Nijaka (zrobiłoś)
zh_hans: 中性

source: Used where Diktilo addresses you in Polish.
ca: S'aplica quan Diktilo s'adreça a tu en polonès.
de: Wird verwendet, wenn Diktilo dich auf Polnisch anspricht.
eo: Uzata, kie Diktilo alparolas vin pole.
pl: Dotyczy zwrotów, w których Diktilo zwraca się do Ciebie, np. „zaoszczędziłeś / zaoszczędziłaś / zaoszczędziłoś”.
zh_hans: 用于 Diktilo 以波兰语称呼你的地方。

source: While you record, this bar appears %@. The round button on the left finishes, %@. The shortcuts underneath finish the recording and send the text to a specific place.
ca: Mentre enregistres, aquesta barra apareix %@. El botó rodó de l'esquerra acaba l'enregistrament, %@. Les dreceres de sota acaben l'enregistrament i envien el text a un lloc concret.
eo: Dum vi registras, ĉi tiu breto aperas %@. La ronda butono maldekstre finas, %@. La klavkombinoj sube finas la registradon kaj sendas la tekston al specifa loko.
pl: Podczas nagrywania ten pasek pojawia się %@. Okrągły przycisk po lewej kończy nagranie, %@. Skróty pod spodem kończą nagranie i wysyłają tekst w konkretne miejsce.

source: Transcribe File
ca: Transcriure un fitxer
de: Datei transkribieren
eo: Transskribi dosieron
pl: Transkrybuj plik
zh_hans: 转写文件

source: Personal Dictionary
ca: Diccionari personal
de: Persönliches Wörterbuch
eo: Persona vortaro
pl: Słownik osobisty
zh_hans: 个人词典

source: Recording
ca: Enregistrament
de: Aufnahme
eo: Registrado
pl: Nagrywanie
zh_hans: 录音

source: Where to change things
ca: On canviar cada cosa
de: Wo du was änderst
eo: Kie ŝanĝi aferojn
pl: Gdzie co zmienić
zh_hans: 在哪里更改设置

source: Used by every mode.
ca: Comú a tots els modes.
de: Gilt für alle Modi.
eo: Komuna por ĉiuj reĝimoj.
pl: Wspólne dla wszystkich trybów.
zh_hans: 所有模式共用。

source: English only
ca: Només anglès
de: Nur Englisch
eo: Nur angla
pl: Tylko angielski
zh_hans: 仅英语

source: Download a model below first
ca: Primer baixa un model de més avall
de: Lade zuerst unten ein Modell herunter
eo: Unue elŝutu modelon sube
pl: Najpierw pobierz model poniżej
zh_hans: 请先在下方下载模型

source: Only downloaded local models, cloud providers with an API key and your custom models are listed.
ca: Només hi apareixen els models locals baixats, els proveïdors al núvol amb clau d'API i els teus models personalitzats.
de: Aufgeführt sind nur heruntergeladene lokale Modelle, Cloud-Anbieter mit API-Schlüssel und deine eigenen Modelle.
eo: En la listo estas nur elŝutitaj lokaj modeloj, nubaj provizantoj kun API-ŝlosilo kaj viaj propraj modeloj.
pl: Na liście są tylko pobrane modele lokalne, dostawcy chmurowi z kluczem API i Twoje własne modele.
zh_hans: 仅列出已下载的本地模型、已配置 API 密钥的云服务商以及你的自定义模型。

source: This model can't transcribe live; it transcribes the whole recording at the end.
ca: Aquest model no pot transcriure en directe; transcriu tot l'enregistrament al final.
de: Dieses Modell transkribiert nicht live, sondern die ganze Aufnahme am Ende.
eo: Ĉi tiu modelo ne povas transskribi vive; ĝi transskribas la tutan registradon je la fino.
pl: Ten model nie transkrybuje na żywo — przepisuje całe nagranie na końcu.
zh_hans: 此模型无法实时转写，会在录音结束后转写整段内容。

source: This model only works live.
ca: Aquest model només funciona en directe.
de: Dieses Modell funktioniert nur live.
eo: Ĉi tiu modelo funkcias nur vive.
pl: Ten model działa tylko na żywo.
zh_hans: 此模型仅支持实时转写。

source: Realtime Streaming (OpenAI Realtime API / speaches)
ca: Transmissió en temps real (OpenAI Realtime API / speaches)
de: Echtzeit-Streaming (OpenAI Realtime API / speaches)
eo: Viva fluado (OpenAI Realtime API / speaches)
pl: Streaming na żywo (OpenAI Realtime API / speaches)
zh_hans: 实时流式传输（OpenAI Realtime API / speaches）

source: Main Shortcut
ca: Drecera principal
de: Haupt-Tastenkürzel
eo: Ĉefa klavkombino
pl: Skrót główny
zh_hans: 主快捷键

source: Uses Mode
ca: Fa servir el mode
de: Verwendet Modus
eo: Uzas reĝimon
pl: Używa trybu
zh_hans: 使用模式

source: When no app or website trigger matches.
ca: Quan no coincideix cap activador d'app o de lloc web.
de: Wenn kein App- oder Website-Auslöser passt.
eo: Kiam neniu ekigilo de aplikaĵo aŭ retejo kongruas.
pl: Gdy żaden wyzwalacz aplikacji ani strony nie pasuje.
zh_hans: 当没有应用或网站触发器匹配时。

source: Last used mode
ca: Últim mode utilitzat
de: Zuletzt verwendeter Modus
eo: Laste uzita reĝimo
pl: Ostatnio używany tryb
zh_hans: 上次使用的模式

source: More Recording Shortcuts
ca: Més dreceres d'enregistrament
de: Weitere Aufnahme-Tastenkürzel
eo: Pliaj registraj klavkombinoj
pl: Więcej skrótów nagrywania
zh_hans: 更多录音快捷键

source: Mode Order
ca: Ordre dels modes
de: Reihenfolge der Modi
eo: Ordo de reĝimoj
pl: Kolejność trybów
zh_hans: 模式顺序

source: Add Mode
ca: Afegir mode
de: Modus hinzufügen
eo: Aldoni reĝimon
pl: Dodaj tryb
zh_hans: 添加模式

source: Add a mode to choose what happens with the text: paste it, copy it, save it or rewrite it with AI.
ca: Afegeix un mode per triar què passa amb el text: enganxar-lo, copiar-lo, desar-lo o reescriure'l amb IA.
de: Füge einen Modus hinzu, um festzulegen, was mit dem Text passiert: einfügen, kopieren, speichern oder mit KI umschreiben.
eo: Aldonu reĝimon por elekti, kio okazu al la teksto: alglui, kopii, konservi aŭ reverki ĝin per AI.
pl: Dodaj tryb, żeby wybrać, co stanie się z tekstem: wklejenie, skopiowanie, zapis albo przeredagowanie przez AI.
zh_hans: 添加模式以选择如何处理文本：粘贴、复制、保存或用 AI 改写。

source: A mode decides where the text goes and whether AI rewrites it. Finish a recording with a mode's shortcut, or let an app or website trigger pick the mode.
ca: Un mode decideix on va el text i si la IA el reescriu. Acaba un enregistrament amb la drecera d'un mode o deixa que un activador d'app o de lloc web triï el mode.
de: Ein Modus legt fest, wohin der Text geht und ob KI ihn umschreibt. Beende eine Aufnahme mit dem Kürzel eines Modus oder lass einen App- oder Website-Auslöser den Modus wählen.
eo: Reĝimo decidas, kien iras la teksto kaj ĉu AI reverkas ĝin. Finu registradon per la klavkombino de reĝimo, aŭ lasu ekigilon de aplikaĵo aŭ retejo elekti la reĝimon.
pl: Tryb decyduje, dokąd trafia tekst i czy AI go przeredaguje. Zakończ nagranie skrótem trybu albo pozwól, by tryb wybrał wyzwalacz aplikacji lub strony.
zh_hans: 模式决定文本的去向以及是否由 AI 改写。用模式的快捷键结束录音，或让应用或网站触发器选择模式。

source: The main shortcut runs this mode when no app or website trigger matches.
ca: La drecera principal executa aquest mode quan no coincideix cap activador d'app o de lloc web.
de: Das Haupt-Tastenkürzel verwendet diesen Modus, wenn kein App- oder Website-Auslöser passt.
eo: La ĉefa klavkombino lanĉas ĉi tiun reĝimon, kiam neniu ekigilo de aplikaĵo aŭ retejo kongruas.
pl: Skrót główny uruchamia ten tryb, gdy żaden wyzwalacz aplikacji ani strony nie pasuje.
zh_hans: 当没有应用或网站触发器匹配时，主快捷键使用此模式。

source: The main shortcut uses this mode. Choose another mode under Main Shortcut to delete this one.
ca: La drecera principal fa servir aquest mode. Per eliminar-lo, primer tria un altre mode a Drecera principal.
de: Das Haupt-Tastenkürzel verwendet diesen Modus. Wähle unter „Haupt-Tastenkürzel“ zuerst einen anderen Modus, um diesen zu löschen.
eo: La ĉefa klavkombino uzas ĉi tiun reĝimon. Por forigi ĝin, unue elektu alian reĝimon sub Ĉefa klavkombino.
pl: Skrót główny używa tego trybu. Żeby go usunąć, najpierw wybierz inny tryb w bloku Skrót główny.
zh_hans: 主快捷键正在使用此模式。请先在“主快捷键”中选择其他模式，再删除此模式。

source: Delete Mode
ca: Eliminar el mode
de: Modus löschen
eo: Forigi reĝimon
pl: Usuń tryb
zh_hans: 删除模式

source: Turn this mode off
ca: Desactivar aquest mode
de: Diesen Modus ausschalten
eo: Malŝalti ĉi tiun reĝimon
pl: Wyłącz ten tryb
zh_hans: 关闭此模式

source: Turn this mode on
ca: Activar aquest mode
de: Diesen Modus einschalten
eo: Ŝalti ĉi tiun reĝimon
pl: Włącz ten tryb
zh_hans: 开启此模式

source: Pasting and Clipboard
ca: Enganxament i porta-retalls
de: Einfügen und Zwischenablage
eo: Algluado kaj tondujo
pl: Wklejanie i schowek
zh_hans: 粘贴与剪贴板

source: Off while “Copy Every Transcription to Clipboard” is on under Pasting and Clipboard.
ca: Desactivat mentre «Copiar cada transcripció al porta-retalls» està activat a Enganxament i porta-retalls.
de: Aus, solange unter „Einfügen und Zwischenablage“ „Jede Transkription in die Zwischenablage kopieren“ aktiv ist.
eo: Malŝaltita, dum „Kopii ĉiun transskribon al la tondujo“ estas ŝaltita sub Algluado kaj tondujo.
pl: Wyłączone, gdy w sekcji Wklejanie i schowek jest włączone „Kopiuj każdą transkrypcję do schowka”.
zh_hans: 当“粘贴与剪贴板”中开启“将每次转写复制到剪贴板”时不可用。

source: Delete Save Target?
ca: Vols eliminar la destinació de desament?
de: Speicherziel löschen?
eo: Ĉu forigi la konservcelon?
pl: Usunąć cel zapisu?
zh_hans: 要删除保存目标吗？

source: Set Recording Shortcut
ca: Definir la drecera d'enregistrament
de: Aufnahme-Kurzbefehl festlegen
eo: Agordi registran klavkombinon
pl: Ustaw skrót nagrywania
zh_hans: 设置录音快捷键

source: Apple Speech is built into macOS, so there is nothing to download.
ca: Apple Speech està integrat a macOS, així que no cal baixar res.
de: Apple Speech ist in macOS integriert, du musst nichts herunterladen.
eo: Apple Speech estas enkonstruita en macOS, do nenio estas elŝutenda.
pl: Apple Speech jest wbudowany w macOS, więc nie trzeba niczego pobierać.
zh_hans: Apple Speech 内置于 macOS，无需下载。

source: Local models are slow on Intel Macs, so a small one is the safe choice. A cloud model with an API key will be faster and more accurate.
ca: Als Mac amb Intel, els models locals són lents, així que el més segur és triar-ne un de petit. Un model al núvol amb clau d'API serà més ràpid i precís.
de: Auf Intel-Macs laufen lokale Modelle langsam, daher ist ein kleines die sichere Wahl. Ein Cloud-Modell mit API-Schlüssel ist schneller und genauer.
eo: Lokaj modeloj estas malrapidaj en Mac-komputiloj kun Intel, do malgranda modelo estas la sekura elekto. Nuba modelo kun API-ŝlosilo estos pli rapida kaj pli preciza.
pl: Na Macu z procesorem Intel modele lokalne działają wolno, więc bezpieczniej wybrać mały. Model w chmurze z kluczem API będzie szybszy i dokładniejszy.
zh_hans: 本地模型在 Intel Mac 上运行较慢，选小模型更稳妥。使用 API 密钥的云端模型会更快、更准确。

source: Made for English: fast, accurate and the smallest download.
ca: Fet per a l'anglès: ràpid, precís i amb la baixada més petita.
de: Für Englisch gemacht: schnell, genau und der kleinste Download.
eo: Farita por la angla: rapida, preciza kaj la plej malgranda elŝutaĵo.
pl: Stworzony dla angielskiego: szybki, dokładny i najmniejszy do pobrania.
zh_hans: 专为英语打造：快速、准确，下载体积最小。

source: Parakeet V3, if you also dictate in other European languages.
ca: Parakeet V3, si també dictes en altres idiomes europeus.
de: Parakeet V3, wenn du auch in anderen europäischen Sprachen diktierst.
eo: Parakeet V3, se vi diktas ankaŭ en aliaj eŭropaj lingvoj.
pl: Parakeet V3, jeśli dyktujesz też w innych językach europejskich.
zh_hans: 如果你也用其他欧洲语言听写，可选 Parakeet V3。

source: Fast and accurate in your language, light on memory, and it can transcribe live.
ca: Ràpid i precís en el teu idioma, lleuger per a la memòria i pot transcriure en directe.
de: Schnell und genau in deiner Sprache, sparsam beim Arbeitsspeicher und kann live transkribieren.
eo: Rapida kaj preciza en via lingvo, ŝparema pri memoro, kaj ĝi povas transskribi vive.
pl: Szybki i dokładny w Twoim języku, oszczędny dla pamięci i potrafi transkrybować na żywo.
zh_hans: 在你的语言中快速准确，占用内存少，并支持实时转写。

source: Parakeet doesn't cover your language. Whisper Large v3 Turbo does, with high accuracy at a moderate size.
ca: Parakeet no és compatible amb el teu idioma. Whisper Large v3 Turbo sí, amb una precisió alta i una mida moderada.
de: Parakeet unterstützt deine Sprache nicht. Whisper Large v3 Turbo schon – sehr genau bei moderater Größe.
eo: Parakeet ne subtenas vian lingvon. Whisper Large v3 Turbo subtenas ĝin, kun alta precizeco ĉe modera grandeco.
pl: Parakeet nie obsługuje Twojego języka. Whisper Large v3 Turbo tak, z wysoką dokładnością przy umiarkowanym rozmiarze.
zh_hans: Parakeet 不支持你的语言，Whisper Large v3 Turbo 支持，准确率高且体积适中。

source: Parakeet doesn't cover your language, and this Mac has little memory for a large model. Whisper Base handles it at a small size.
ca: Parakeet no és compatible amb el teu idioma i aquest Mac té poca memòria per a un model gran. Whisper Base se'n surt amb una mida petita.
de: Parakeet unterstützt deine Sprache nicht, und dieser Mac hat wenig Speicher für ein großes Modell. Whisper Base schafft es bei kleiner Größe.
eo: Parakeet ne subtenas vian lingvon, kaj ĉi tiu Mac havas tro malmulte da memoro por granda modelo. Whisper Base sukcesas ĉe malgranda grandeco.
pl: Parakeet nie obsługuje Twojego języka, a ten Mac ma za mało pamięci na duży model. Whisper Base poradzi sobie przy niewielkim rozmiarze.
zh_hans: Parakeet 不支持你的语言，而这台 Mac 内存不足以运行大模型。Whisper Base 体积小，也能胜任。

source: Local model
ca: Model local
de: Lokales Modell
eo: Loka modelo
pl: Model lokalny
zh_hans: 本地模型

source: Local model (Ollama)
ca: Model local (Ollama)
de: Lokales Modell (Ollama)
eo: Loka modelo (Ollama)
pl: Model lokalny (Ollama)
zh_hans: 本地模型（Ollama）

source: Runs on your Mac. Your recordings never leave the computer and it works offline. You download it once; its speed depends on your Mac.
ca: S'executa al teu Mac. Els enregistraments no surten mai de l'ordinador i funciona sense connexió. El baixes una sola vegada; la velocitat depèn del teu Mac.
de: Läuft auf deinem Mac. Deine Aufnahmen verlassen den Computer nie, und es funktioniert offline. Du lädst es einmal herunter; die Geschwindigkeit hängt von deinem Mac ab.
eo: Funkcias en via Mac. Viaj registradoj neniam forlasas la komputilon, kaj ĝi funkcias senkonekte. Vi elŝutas ĝin unufoje; ĝia rapido dependas de via Mac.
pl: Działa na Twoim Macu. Nagrania nie wychodzą poza komputer, a transkrypcja działa bez internetu. Pobierasz go raz; szybkość zależy od komputera.
zh_hans: 在你的 Mac 上运行。录音不会离开电脑，离线也能用。只需下载一次，速度取决于你的 Mac。

source: AI rewrites your text on your Mac. Nothing leaves the computer and it works offline, but you need Ollama installed and a fairly powerful Mac.
ca: La IA reescriu el text al teu Mac. No surt res de l'ordinador i funciona sense connexió, però cal tenir Ollama instal·lat i un Mac força potent.
de: Die KI überarbeitet deinen Text auf deinem Mac. Nichts verlässt den Computer, und es funktioniert offline – du brauchst aber Ollama und einen recht leistungsfähigen Mac.
eo: AI reverkas vian tekston en via Mac. Nenio forlasas la komputilon kaj ĝi funkcias senkonekte, sed vi bezonas instalitan Ollama kaj sufiĉe potencan Mac.
pl: AI przeredagowuje tekst na Twoim Macu. Nic nie wychodzi poza komputer i działa bez internetu, ale potrzebujesz zainstalowanej Ollamy i dość mocnego Maca.
zh_hans: AI 在你的 Mac 上改写文本。内容不会离开电脑，离线也能用，但需要安装 Ollama，并且 Mac 性能要较强。

source: The recording goes to an outside provider (e.g. Groq, OpenAI, ElevenLabs), which sends back the text. The key is your personal ID with that provider: you create an account, copy the key and paste it into Diktilo. You pay the provider for use, often with a free allowance. Needs internet; recordings go to the provider's servers.
ca: L'enregistrament s'envia a un proveïdor extern (p. ex., Groq, OpenAI, ElevenLabs), que et retorna el text. La clau és el teu identificador personal amb aquest proveïdor: hi crees un compte, copies la clau i l'enganxes a Diktilo. Pagues el proveïdor per l'ús, sovint amb una quota gratuïta. Cal connexió a Internet; els enregistraments van als servidors del proveïdor.
de: Die Aufnahme geht an einen externen Anbieter (z. B. Groq, OpenAI, ElevenLabs), der den Text zurückschickt. Der Schlüssel ist deine persönliche Kennung bei diesem Anbieter: Du legst ein Konto an, kopierst den Schlüssel und fügst ihn in Diktilo ein. Du bezahlst den Anbieter nach Nutzung, oft mit Freikontingent. Internet nötig; Aufnahmen landen auf den Servern des Anbieters.
eo: La registrado iras al ekstera provizanto (ekz. Groq, OpenAI, ElevenLabs), kiu resendas la tekston. La ŝlosilo estas via persona identigilo ĉe tiu provizanto: vi kreas konton, kopias la ŝlosilon kaj algluas ĝin en Diktilon. Vi pagas al la provizanto por la uzado, ofte kun senpaga kvoto. Necesas interreto; registradoj iras al la serviloj de la provizanto.
pl: Nagranie trafia do zewnętrznego dostawcy (np. Groq, OpenAI, ElevenLabs), który odsyła tekst. Klucz to Twój osobisty identyfikator u dostawcy: zakładasz konto, kopiujesz klucz i wklejasz go w Diktilo. Za użycie płacisz dostawcy, często z darmowym limitem. Potrzebny jest internet, a nagrania trafiają na serwery dostawcy.
zh_hans: 录音会发送给外部服务商（如 Groq、OpenAI、ElevenLabs），由其返回文本。密钥是你在该服务商处的个人凭证：注册账户、复制密钥并粘贴到 Diktilo。按使用量向服务商付费，通常有免费额度。需要联网，录音会上传到服务商的服务器。

source: The text (not the recording) goes to a provider such as Groq or OpenAI, which sends back the rewritten version. You create an account there, copy the key and paste it into Diktilo. You pay for use, often with a free allowance.
ca: El text (no l'enregistrament) s'envia a un proveïdor com Groq o OpenAI, que et retorna la versió reescrita. Hi crees un compte, copies la clau i l'enganxes a Diktilo. Pagues per l'ús, sovint amb una quota gratuïta.
de: Der Text (nicht die Aufnahme) geht an einen Anbieter wie Groq oder OpenAI, der die überarbeitete Fassung zurückschickt. Du legst dort ein Konto an, kopierst den Schlüssel und fügst ihn in Diktilo ein. Du zahlst nach Nutzung, oft mit Freikontingent.
eo: La teksto (ne la registrado) iras al provizanto kiel Groq aŭ OpenAI, kiu resendas la reverkitan version. Vi kreas tie konton, kopias la ŝlosilon kaj algluas ĝin en Diktilon. Vi pagas por la uzado, ofte kun senpaga kvoto.
pl: Do dostawcy, np. Groq albo OpenAI, trafia tekst (nie nagranie), a on odsyła przeredagowaną wersję. Zakładasz tam konto, kopiujesz klucz i wklejasz go w Diktilo. Płacisz za użycie, często z darmowym limitem.
zh_hans: 文本（而非录音）会发送给 Groq 或 OpenAI 等服务商，由其返回改写后的版本。你在那里注册账户、复制密钥并粘贴到 Diktilo。按使用量付费，通常有免费额度。

source: Own server: a custom model can point to a server of your own (e.g. speaches), and recordings go only there.
ca: Servidor propi: un model personalitzat pot apuntar a un servidor teu (p. ex., speaches), i els enregistraments només van allà.
de: Eigener Server: Ein eigenes Modell kann auf deinen Server zeigen (z. B. speaches), dann gehen Aufnahmen nur dorthin.
eo: Propra servilo: propra modelo povas montri al via propra servilo (ekz. speaches), kaj registradoj iras nur tien.
pl: Własny serwer: model własny może wskazywać Twój serwer (np. speaches) — wtedy nagrania trafiają tylko tam.
zh_hans: 自有服务器：自定义模型可以指向你自己的服务器（如 speaches），录音只会发送到那里。

source: The same choice applies to AI enhancement: locally through Ollama or with a provider's key.
ca: La mateixa elecció s'aplica a la millora amb IA: localment amb Ollama o amb la clau d'un proveïdor.
de: Dieselbe Wahl gilt für die KI-Verbesserung: lokal über Ollama oder mit dem Schlüssel eines Anbieters.
eo: La sama elekto validas por AI-plibonigo: loke per Ollama aŭ per ŝlosilo de provizanto.
pl: Ten sam wybór dotyczy ulepszania AI: lokalnie przez Ollamę albo kluczem dostawcy.
zh_hans: AI 优化也有同样的选择：通过 Ollama 本地运行，或使用服务商的密钥。

source: Local or with an API key?
ca: Local o amb clau d'API?
de: Lokal oder mit API-Schlüssel?
eo: Ĉu loke aŭ per API-ŝlosilo?
pl: Lokalnie czy przez klucz API?
zh_hans: 本地还是使用 API 密钥？

source: Model for This Mac
ca: Model per a aquest Mac
de: Modell für diesen Mac
eo: Modelo por ĉi tiu Mac
pl: Dobór modelu do tego Maca
zh_hans: 适合这台 Mac 的模型

source: Dictation language: %@
ca: Idioma de dictat: %@
de: Diktiersprache: %@
eo: Lingvo de diktado: %@
pl: Język dyktowania: %@
zh_hans: 听写语言：%@

source: Recommended: %@
ca: Recomanat: %@
de: Empfohlen: %@
eo: Rekomendata: %@
pl: Zalecany: %@
zh_hans: 推荐：%@

source: Alternative: %@. %@
ca: Alternativa: %@. %@
de: Alternative: %1$@. %2$@
eo: Alternativo: %@. %@
pl: Alternatywa: %1$@. %2$@
zh_hans: 备选：%1$@。%2$@

source: Set Up a Cloud Model
ca: Configurar un model al núvol
de: Cloud-Modell einrichten
eo: Agordi nuban modelon
pl: Skonfiguruj model w chmurze
zh_hans: 设置云端模型

source: You're using the recommended model
ca: Ja fas servir el model recomanat
de: Du nutzt das empfohlene Modell
eo: Vi uzas la rekomendatan modelon
pl: Używasz zalecanego modelu
zh_hans: 你正在使用推荐的模型

source: Downloading…
ca: S'està baixant…
de: Wird heruntergeladen…
eo: Elŝutado…
pl: Pobieranie…
zh_hans: 正在下载…

source: Use This Model
ca: Utilitzar aquest model
de: Dieses Modell verwenden
eo: Uzi ĉi tiun modelon
pl: Używaj tego modelu
zh_hans: 使用此模型

source: Download and Use
ca: Baixar i utilitzar
de: Laden und verwenden
eo: Elŝuti kaj uzi
pl: Pobierz i używaj
zh_hans: 下载并使用

source: Recommended for this Mac: %@
ca: Recomanat per a aquest Mac: %@
de: Empfohlen für diesen Mac: %@
eo: Rekomendata por ĉi tiu Mac: %@
pl: Zalecany dla tego Maca: %@
zh_hans: 推荐给这台 Mac：%@
